todo.org
# Created 2021-06-15 Tue 18:23
#+OPTIONS: H:3 num:nil toc:nil \n:nil ::t |:t ^:nil -:t f:t *:t tex:t d:(HIDE) tags:not-in-toc
#+TITLE: TODO central file for Worg
#+AUTHOR: Worg people
#+startup: align fold nodlcheck hidestars oddeven lognotestate
#+seq_todo: TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+tags: Write(w) Update(u) Fix(f) Check(c)
#+language: en
#+priorities: A C B
#+category: worg
#+archive: ::* Archived tasks
#+html_link_up: index.html
#+html_link_home: https://orgmode.org/worg/

This file is the central page for inserting tasks related to Worg.

If you keep a local copy of worg in =~/org/Worg/=, then you can
add =~/org/Worg/todo.org= to the list of your agenda files.

Then a simple =git pull= will update the tasks in this file, and your
agenda view will be populated with Worg-related tasks.

* General tasks

** DONE Simplify/merge worg-about.org, worg-maintenance.org, worg-git.org
** TODO Add a note in files which need an update
** DONE Update links for 'org-fireforg' in org-devel.org
** TODO Update doc.org from latest stable
** TODO Make a comprehensive list of Org exporters (see [[https://orgmode.org/list/87r1r5jvak.fsf@gnu.org/][this message]])
** TODO Update org-contrib/babel/languages/ob-doc-ditaa.org

Ditaa is not included in Org anymore.  See
https://github.com/stathissideris/ditaa.

** TODO Write Babel doc to show what value/output returns for each language

See https://orgmode.org/list/87imjyoi99.fsf@gnu.org/ for context.

* Work on tutorials

** TODO Enhance the main tutorial
** TODO Add a dedicated file for mobile workflows with org
** Gather examples of custom agenda views from the mailing list
** Tutorial about links (export and abbrev)
** Tutorial about the LaTeX exporter
* Archived tasks

** DONE Rename this file to todo.org and update references

** DONE Remove worg-todo_archive (as it is not exported and not needed)

** DONE Remove references to repo.or.cz

** DONE Remove references to org-install.el
