todo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-15 Tue 18:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TODO central file for Worg</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Worg people" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
 <link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="https://orgmode.org/worg/"> HOME </a>
</div><div id="content">
<h1 class="title">TODO central file for Worg</h1>
<p>
This file is the central page for inserting tasks related to Worg.
</p>

<p>
If you keep a local copy of worg in <code>~/org/Worg/</code>, then you can
add <code>~/org/Worg/todo.org</code> to the list of your agenda files.
</p>

<p>
Then a simple <code>git pull</code> will update the tasks in this file, and your
agenda view will be populated with Worg-related tasks.
</p>

<div id="outline-container-orgbf4971a" class="outline-2">
<h2 id="orgbf4971a">General tasks</h2>
<div class="outline-text-2" id="text-orgbf4971a">
</div>
<div id="outline-container-orgc71823e" class="outline-3">
<h3 id="orgc71823e"><span class="done DONE">DONE</span> Simplify/merge worg-about.org, worg-maintenance.org, worg-git.org</h3>
</div>
<div id="outline-container-org9895fa2" class="outline-3">
<h3 id="org9895fa2"><span class="todo TODO">TODO</span> Add a note in files which need an update</h3>
</div>
<div id="outline-container-orgaa27abf" class="outline-3">
<h3 id="orgaa27abf"><span class="done DONE">DONE</span> Update links for &rsquo;org-fireforg&rsquo; in org-devel.org</h3>
</div>
<div id="outline-container-orgddd9d67" class="outline-3">
<h3 id="orgddd9d67"><span class="todo TODO">TODO</span> Update doc.org from latest stable</h3>
</div>
<div id="outline-container-org7dda884" class="outline-3">
<h3 id="org7dda884"><span class="todo TODO">TODO</span> Make a comprehensive list of Org exporters (see <a href="https://orgmode.org/list/87r1r5jvak.fsf@gnu.org/">this message</a>)</h3>
</div>
<div id="outline-container-org1bf9e40" class="outline-3">
<h3 id="org1bf9e40"><span class="todo TODO">TODO</span> Update org-contrib/babel/languages/ob-doc-ditaa.org</h3>
<div class="outline-text-3" id="text-org1bf9e40">
<p>
Ditaa is not included in Org anymore.  See
<a href="https://github.com/stathissideris/ditaa">https://github.com/stathissideris/ditaa</a>.
</p>
</div>
</div>

<div id="outline-container-orgbc5d96a" class="outline-3">
<h3 id="orgbc5d96a"><span class="todo TODO">TODO</span> Write Babel doc to show what value/output returns for each language</h3>
<div class="outline-text-3" id="text-orgbc5d96a">
<p>
See <a href="https://orgmode.org/list/87imjyoi99.fsf@gnu.org/">https://orgmode.org/list/87imjyoi99.fsf@gnu.org/</a> for context.
</p>
</div>
</div>
</div>

<div id="outline-container-orge0d65b4" class="outline-2">
<h2 id="orge0d65b4">Work on tutorials</h2>
<div class="outline-text-2" id="text-orge0d65b4">
</div>
<div id="outline-container-orgf0b19be" class="outline-3">
<h3 id="orgf0b19be"><span class="todo TODO">TODO</span> Enhance the main tutorial</h3>
</div>
<div id="outline-container-org0b2cff8" class="outline-3">
<h3 id="org0b2cff8"><span class="todo TODO">TODO</span> Add a dedicated file for mobile workflows with org</h3>
</div>
<div id="outline-container-org97a85a8" class="outline-3">
<h3 id="org97a85a8">Gather examples of custom agenda views from the mailing list</h3>
</div>
<div id="outline-container-orgd925daa" class="outline-3">
<h3 id="orgd925daa">Tutorial about links (export and abbrev)</h3>
</div>
<div id="outline-container-orgb35c18a" class="outline-3">
<h3 id="orgb35c18a">Tutorial about the LaTeX exporter</h3>
</div>
</div>
<div id="outline-container-orga1b7155" class="outline-2">
<h2 id="orga1b7155">Archived tasks</h2>
<div class="outline-text-2" id="text-orga1b7155">
</div>
<div id="outline-container-org35e79e4" class="outline-3">
<h3 id="org35e79e4"><span class="done DONE">DONE</span> Rename this file to todo.org and update references</h3>
<div class="outline-text-3" id="text-org35e79e4">
</div>
</div>

<div id="outline-container-org3625257" class="outline-3">
<h3 id="org3625257"><span class="done DONE">DONE</span> Remove worg-todo_archive (as it is not exported and not needed)</h3>
<div class="outline-text-3" id="text-org3625257">
</div>
</div>

<div id="outline-container-org5d11c6d" class="outline-3">
<h3 id="org5d11c6d"><span class="done DONE">DONE</span> Remove references to repo.or.cz</h3>
<div class="outline-text-3" id="text-org5d11c6d">
</div>
</div>

<div id="outline-container-org2d45bdb" class="outline-3">
<h3 id="org2d45bdb"><span class="done DONE">DONE</span> Remove references to org-install.el</h3>
<div class="outline-text-3" id="text-org2d45bdb">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Worg people</p>
<p class="date">Created: 2021-06-15 Tue 18:23</p>
</div>
</body>
</html>
